[Killed] ObjectLiteral
main/pages/UCSBOrganization/UCSBOrganizationEditPage.js:22:15
       // Stryker disable next-line all : GET is the default, so mutating this to "" doesn't introduce a bug
       method: "GET",
       url: `/api/ucsborganizations`,
-      params: {
-        code: id,
-      },
+      params: {},
     },
   );
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="UCSBOrganizationForm-orgCode"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
