[Killed] ObjectLiteral
main/components/UCSBOrganization/UCSBOrganizationTable.js:51:5
       Header: "OrgTranslation",
       accessor: "orgTranslation",
     },
-    {
-      Header: "Inactive",
-      id: "inactive",
-      accessor: (row) => String(row.inactive),
-    },
+    {},
   ];
 
killedBy: UCSBOrganizationIndexPage tests Renders with Create Button for admin user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ConditionalExpression
main/components/UCSBOrganization/UCSBOrganizationTable.js:67:13
 
   return (
     <OurTable
-      data={ucsborganizations || []}
+      data={true}
       columns={columns}
       testid={testIdPrefix}
killedBy: UCSBOrganizationIndexPage tests Renders with Create Button for admin user
statusReason: TypeError: data.forEach is not a function

[Killed] ConditionalExpression
main/components/UCSBOrganization/UCSBOrganizationTable.js:67:13
 
   return (
     <OurTable
-      data={ucsborganizations || []}
+      data={false}
       columns={columns}
       testid={testIdPrefix}
killedBy: UCSBOrganizationIndexPage tests Renders with Create Button for admin user
statusReason: TypeError: data.forEach is not a function
