[Killed] ConditionalExpression
main/pages/UCSBOrganization/UCSBOrganizationIndexPage.js:44:30
         {createButton()}
         <h1>UCSB Organizations</h1>
         <UCSBOrganizationTable
-          ucsborganizations={ucsborganizations || []}
+          ucsborganizations={true}
           currentUser={currentUser}
         />
killedBy: UCSBOrganizationIndexPage tests Renders with Create Button for admin user
statusReason: TypeError: data.forEach is not a function

[Killed] ConditionalExpression
main/pages/UCSBOrganization/UCSBOrganizationIndexPage.js:44:30
         {createButton()}
         <h1>UCSB Organizations</h1>
         <UCSBOrganizationTable
-          ucsborganizations={ucsborganizations || []}
+          ucsborganizations={false}
           currentUser={currentUser}
         />
killedBy: UCSBOrganizationIndexPage tests renders three organizations correctly for regular user
statusReason: Error: Unable to find an element by: [data-testid="UCSBOrganizationTable-cell-row-0-col-orgCode"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
