[Killed] BlockStatement
src/main/utils/UCSBOrganizationUtils.js:8:47
   toast(message);
 }
 
-export function cellToAxiosParamsDelete(cell) {
-  return {
-    url: "/api/ucsborganizations",
-    method: "DELETE",
-    params: {
-      id: cell.row.values.orgCode,
-    },
-  };
-}
+export function cellToAxiosParamsDelete(cell) {}
 
killedBy: UCSBOrganizationIndexPage tests what happens when you click delete, admin
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Organization with orgCode ACM was deleted"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2
