[Killed] ArrowFunction
main/components/RecommendationRequests/RecommendationRequestForm.js:26:20
   const navigate = useNavigate();
   const testIdPrefix = "RecommendationRequestForm";
 
-  const onSubmit = (data) => submitAction(data);
+  const onSubmit = () => undefined;
 
   return (
killedBy: RecommendationRequestsCreatePage tests on submit, makes request to backend, and redirects to /recommendationrequests
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ObjectLiteral
main/components/RecommendationRequests/RecommendationRequestForm.js:128:22
           isInvalid={Boolean(errors.dateNeeded)}
           {...register("dateNeeded", {
             required: "Date Needed is required.",
-            pattern: {
-              value: isodate_regex,
-              message:
-                "Date must be in ISO format (YYYY-MM-DDTHH:MM or YYYY-MM-DDTHH:MM:SS)",
-            },
+            pattern: {},
           })}
         />
killedBy: RecommendationRequestForm tests shows error when datetime fields do not match ISO pattern
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 1
Received array:  [<div class="invalid-feedback">Date must be in ISO format (YYYY-MM-DDTHH:MM or YYYY-MM-DDTHH:MM:SS)</div>]
