[Killed] StringLiteral
main/components/RecommendationRequests/RecommendationRequestTable.js:54:15
       accessor: "explanation",
     },
     {
-      Header: "Date Requested (ISO)",
+      Header: "",
       accessor: (row) => row.dateRequested?.replace("T", " "),
       id: "dateRequested",
killedBy: RecommendationRequestTable tests renders empty table correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: Date Requested (ISO). This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table

[Killed] ArrowFunction
main/components/RecommendationRequests/RecommendationRequestTable.js:55:17
     },
     {
       Header: "Date Requested (ISO)",
-      accessor: (row) => row.dateRequested?.replace("T", " "),
+      accessor: () => undefined,
       id: "dateRequested",
     },
killedBy: RecommendationRequestTable tests dateRequested and dateNeeded accessors format ISO string correctly
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  2025-05-02 08:00:00
Received:

[Killed] OptionalChaining
main/components/RecommendationRequests/RecommendationRequestTable.js:55:26
     },
     {
       Header: "Date Requested (ISO)",
-      accessor: (row) => row.dateRequested?.replace("T", " "),
+      accessor: (row) => row.dateRequested.replace("T", " "),
       id: "dateRequested",
     },
killedBy: RecommendationRequestTable tests renders empty string when dateRequested is null
statusReason: TypeError: Cannot read properties of null (reading 'replace')

[Killed] OptionalChaining
main/components/RecommendationRequests/RecommendationRequestTable.js:60:26
     },
     {
       Header: "Date Needed (ISO)",
-      accessor: (row) => row.dateNeeded?.replace("T", " "),
+      accessor: (row) => row.dateNeeded.replace("T", " "),
       id: "dateNeeded",
     },
killedBy: RecommendationRequestTable tests renders empty string when dateNeeded is undefined
statusReason: TypeError: Cannot read properties of undefined (reading 'replace')

[Killed] ArrowFunction
main/components/RecommendationRequests/RecommendationRequestTable.js:60:17
     },
     {
       Header: "Date Needed (ISO)",
-      accessor: (row) => row.dateNeeded?.replace("T", " "),
+      accessor: () => undefined,
       id: "dateNeeded",
     },
killedBy: RecommendationRequestTable tests dateRequested and dateNeeded accessors format ISO string correctly
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  2025-09-26 08:00:00
Received:

[Killed] StringLiteral
main/components/RecommendationRequests/RecommendationRequestTable.js:61:11
     {
       Header: "Date Needed (ISO)",
       accessor: (row) => row.dateNeeded?.replace("T", " "),
-      id: "dateNeeded",
+      id: "",
     },
     {
killedBy: RecommendationRequestTable tests Has the expected column headers, content and buttons for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RecommendationRequestTable-cell-row-0-col-dateNeeded"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/RecommendationRequests/RecommendationRequestTable.js:64:15
       id: "dateNeeded",
     },
     {
-      Header: "Done?",
+      Header: "",
       accessor: (row) => (row.done ? "✅" : "❌"),
       id: "done",
killedBy: RecommendationRequestTable tests renders empty table correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: Done?. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ArrowFunction
main/components/RecommendationRequests/RecommendationRequestTable.js:65:17
     },
     {
       Header: "Done?",
-      accessor: (row) => (row.done ? "✅" : "❌"),
+      accessor: () => undefined,
       id: "done",
     },
killedBy: RecommendationRequestTable tests done accessor correctly renders ✅ or ❌
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  ✅
Received:

[Killed] StringLiteral
main/components/RecommendationRequests/RecommendationRequestTable.js:65:38
     },
     {
       Header: "Done?",
-      accessor: (row) => (row.done ? "✅" : "❌"),
+      accessor: (row) => (row.done ? "" : "❌"),
       id: "done",
     },
killedBy: RecommendationRequestTable tests done accessor correctly renders ✅ or ❌
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  ✅
Received:
