[Killed] ArrowFunction
main/pages/RecommendationRequests/RecommendationRequestsCreatePage.js:10:31
 export default function RecommendationRequestsCreatePage({
   storybook = false,
 }) {
-  const objectToAxiosParams = (recommendationRequest) => ({
-    url: "/api/recommendationrequest/post",
-    method: "POST",
-    params: {
-      requesterEmail: recommendationRequest.requesterEmail,
-      professorEmail: recommendationRequest.professorEmail,
-      explanation: recommendationRequest.explanation,
-      dateRequested: recommendationRequest.dateRequested,
-      dateNeeded: recommendationRequest.dateNeeded,
-      done: recommendationRequest.done,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (recommendationRequest) => {
killedBy: RecommendationRequestsCreatePage tests on submit, makes request to backend, and redirects to /recommendationrequests
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
main/pages/RecommendationRequests/RecommendationRequestsCreatePage.js:23:48
     },
   });
 
-  const onSuccess = (recommendationRequest) => {
-    toast(
-      `New recommendation request Created - id: ${recommendationRequest.id} requesterEmail: ${recommendationRequest.requesterEmail}`,
-    );
-  };
+  const onSuccess = (recommendationRequest) => {};
 
   const mutation = useBackendMutation(
killedBy: RecommendationRequestsCreatePage tests on submit, makes request to backend, and redirects to /recommendationrequests
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New recommendation request Created - id: 4 requesterEmail: student@ucsb.edu"

Number of calls: 0

[Killed] StringLiteral
main/pages/RecommendationRequests/RecommendationRequestsCreatePage.js:25:7
 
   const onSuccess = (recommendationRequest) => {
     toast(
-      `New recommendation request Created - id: ${recommendationRequest.id} requesterEmail: ${recommendationRequest.requesterEmail}`,
+      ``,
     );
   };
killedBy: RecommendationRequestsCreatePage tests on submit, makes request to backend, and redirects to /recommendationrequests
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New recommendation request Created - id: 4 requesterEmail: student@ucsb.edu"
Received: ""

Number of calls: 1
