[Killed] ObjectLiteral
main/pages/RecommendationRequests/RecommendationRequestsEditPage.js:17:5
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     [`/api/recommendationrequest?id=${id}`],
-    {
-      // Stryker disable next-line all : GET is the default, so mutating this to "" doesn't introduce a bug
-      method: "GET",
-      url: "/api/recommendationrequest",
-      params: { id },
-    },
+    {},
   );
 
killedBy: RecommendationRequestsEditPage tests when the backend returns data normally form is populated with the existing data
statusReason: Error: Unable to find an element by: [data-testid="RecommendationRequestForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/pages/RecommendationRequests/RecommendationRequestsEditPage.js:20:12
     {
       // Stryker disable next-line all : GET is the default, so mutating this to "" doesn't introduce a bug
       method: "GET",
-      url: "/api/recommendationrequest",
+      url: "",
       params: { id },
     },
killedBy: RecommendationRequestsEditPage tests when the backend returns data normally form is populated with the existing data
statusReason: Error: Unable to find an element by: [data-testid="RecommendationRequestForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrowFunction
main/pages/RecommendationRequests/RecommendationRequestsEditPage.js:25:34
     },
   );
 
-  const objectToAxiosPutParams = (rr) => ({
-    url: "/api/recommendationrequest",
-    method: "PUT",
-    params: { id: rr.id },
-    data: {
-      requesterEmail: rr.requesterEmail,
-      professorEmail: rr.professorEmail,
-      explanation: rr.explanation,
-      dateRequested: rr.dateRequested,
-      dateNeeded: rr.dateNeeded,
-      done: rr.done,
-    },
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (rr) => {
killedBy: RecommendationRequestsEditPage tests when the backend returns data normally clicking Update sends PUT, shows toast and navigates
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "RecommendationRequest Updated - id: 1 requesterEmail: hungkhuu@ucsb.edu"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] BlockStatement
main/pages/RecommendationRequests/RecommendationRequestsEditPage.js:39:29
     },
   });
 
-  const onSuccess = (rr) => {
-    toast(
-      `RecommendationRequest Updated - id: ${rr.id} requesterEmail: ${rr.requesterEmail}`,
-    );
-  };
+  const onSuccess = (rr) => {};
 
   const mutation = useBackendMutation(
killedBy: RecommendationRequestsEditPage tests when the backend returns data normally form is populated with the existing data
statusReason: Error: Unable to find an element by: [data-testid="RecommendationRequestForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
