[Killed] StringLiteral
main/components/MenuItemReviews/MenuItemReviewForm.js:72:23
           type="text"
           isInvalid={Boolean(errors.revieweremail)}
           {...register("revieweremail", {
-            required: "Reviewer Email is required",
+            required: "",
           })}
         />
killedBy: MenuItemReviewForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Reviewer Email is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/MenuItemReviews/MenuItemReviewForm.js:88:23
           type="text"
           isInvalid={Boolean(errors.stars)}
           {...register("stars", {
-            required: "Stars is required",
+            required: "",
           })}
         />
killedBy: MenuItemReviewForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Stars is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/MenuItemReviews/MenuItemReviewForm.js:104:23
           type="text"
           isInvalid={Boolean(errors.comments)}
           {...register("comments", {
-            required: "Comments is required",
+            required: "",
           })}
         />
killedBy: MenuItemReviewForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Comments is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/MenuItemReviews/MenuItemReviewForm.js:119:40
           id="datereviewed"
           type="datetime-local"
           isInvalid={Boolean(errors.datereviewed)}
-          {...register("datereviewed", {
-            required: true,
-            // pattern: isodate_regex,
-          })}
+          {...register("datereviewed", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Date Reviewed is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] BooleanLiteral
main/components/MenuItemReviews/MenuItemReviewForm.js:120:23
           type="datetime-local"
           isInvalid={Boolean(errors.datereviewed)}
           {...register("datereviewed", {
-            required: true,
+            required: false,
             // pattern: isodate_regex,
           })}
killedBy: MenuItemReviewForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Date Reviewed is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/MenuItemReviews/MenuItemReviewForm.js:125:12
           })}
         />
         <Form.Control.Feedback type="invalid">
-          {errors.datereviewed && "Date Reviewed is required"}
+          {errors.datereviewed || "Date Reviewed is required"}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: MenuItemReviewForm tests that the correct validations are performed
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.

[Killed] ConditionalExpression
main/components/MenuItemReviews/MenuItemReviewForm.js:125:12
           })}
         />
         <Form.Control.Feedback type="invalid">
-          {errors.datereviewed && "Date Reviewed is required"}
+          {true}
         </Form.Control.Feedback>
       </Form.Group>
killedBy: MenuItemReviewForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Date Reviewed is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
