[Killed] ArrowFunction
main/pages/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemsCreatePage.js:10:31
 export default function UCSBDiningCommonsMenuItemCreatePage({
   storybook = false,
 }) {
-  const objectToAxiosParams = (ucsbdiningcommonsmenuitem) => ({
-    url: "/api/ucsbdiningcommonsmenuitems/post",
-    method: "POST",
-    params: {
-      diningCommonsCode: ucsbdiningcommonsmenuitem.diningCommonsCode,
-      name: ucsbdiningcommonsmenuitem.name,
-      station: ucsbdiningcommonsmenuitem.station,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (ucsbdiningcommonsmenuitem) => {
killedBy: UCSBDiningCommonsMenuItemCreatePage tests on submit, makes request to backend, and redirects to /ucsbdiningcommonsmenuitems
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
main/pages/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemsCreatePage.js:20:52
     },
   });
 
-  const onSuccess = (ucsbdiningcommonsmenuitem) => {
-    toast(
-      `New menu item Created - id: ${ucsbdiningcommonsmenuitem.id} name: ${ucsbdiningcommonsmenuitem.name}`,
-    );
-  };
+  const onSuccess = (ucsbdiningcommonsmenuitem) => {};
 
   const mutation = useBackendMutation(
killedBy: UCSBDiningCommonsMenuItemCreatePage tests on submit, makes request to backend, and redirects to /ucsbdiningcommonsmenuitems
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "New menu item Created - id: 1 name: Big Sandwich"

Number of calls: 0
